Revit 2027 API
BuiltInFailures.DesignOptionFailures.OptionElementsDeleted Property
 Elements in [option] were deleted
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId OptionElementsDeleted { get; }
Public Shared ReadOnly Property OptionElementsDeleted As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ OptionElementsDeleted {
	FailureDefinitionId^ get ();
}
static member OptionElementsDeleted : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.DesignOptionFailures Class
Autodesk.Revit.DB Namespace